# G2M Insight for Cab Investment Firm

In [25]:
import pandas as pd

In [26]:
cab_data = pd.read_csv("datasets/Cab_Data.csv")
city_data = pd.read_csv("datasets/City.csv")
customer_data = pd.read_csv("datasets/Customer_ID.csv")
transaction_data = pd.read_csv("datasets/Transaction_ID.csv")

## Data Profiling
#### Cab Dataset

In [27]:
print("CAB DATA INFO")
cab_data_info = cab_data.info()
print("\nCAB DATA HEAD")
cab_data_head = cab_data.head()
display(cab_data_head)
print("\nCAB DATA DESCRIBE")
cab_data_describe = cab_data.describe()
display(cab_data_describe)

CAB DATA INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

CAB DATA HEAD

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

CAB DATA DESCRIBE

,Transaction ID,Date of Travel,KM Travelled,Price Charged,Cost of Trip
count,3.593920e+05,359392.000000,359392.000000,359392.000000,359392.000000
mean,1.022076e+07,42964.067998,22.567254,423.443311,286.190113
std,1.268058e+05,307.467197,12.233526,274.378911,157.993661
min,1.000001e+07,42371.000000,1.900000,15.600000,19.000000
25%,1.011081e+07,42697.000000,12.000000,206.437500,151.200000
50%,1.022104e+07,42988.000000,22.440000,386.360000,282.480000
75%,1.033094e+07,43232.000000,32.960000,583.660000,413.683200
max,1.044011e+07,43465.000000,48.000000,2048.030000,691.200000

High-level Observations and Insights On Cab Dataset
- The Date of Travel column is in Excel serial date format
    - May need conversion if pandas has no easy way to deal with these dates
- Future analysis topics from this table
    - (Price charged - cost of trip) to find **profitability** of each company
    - Compare KM traveled to date of travel/city to find trends
- No null values found

#### City Dataset

In [37]:
print("CITY DATA INFO")
city_data_info = city_data.info()
print("\nCITY DATA HEAD")
city_data_head = city_data.head()
display(city_data_head)
print("\nCITY DATA DESCRIBE")
city_data_describe = city_data.describe()
display(city_data_describe)

CITY DATA INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

CITY DATA HEAD

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247

CITY DATA DESCRIBE

               City   Population      Users
count            20           20         20
unique           20           20         20
top     NEW YORK NY   8,405,837    302,149
freq              1            1          1

High-level Observations and Insights On City Dataset
- The population and users columns are not integers
    - This will hinder future analysis and should be dealt with in cleaning phase
- This dataset in combination with the number of cab users can be used to find **market penetration**
    - This can also allude to adoption rate of new cabs
- This dataset in combination with cab_data can be used to see profits by city
- No null values found

#### Customer Dataset

In [38]:
print("CUSTOMER DATA INFO")
customer_data_info = customer_data.info()
print("\nCUSTOMER DATA HEAD")
customer_data_head = customer_data.head()
display(customer_data_head)
print("\nCUSTOMER DATA DESCRIBE")
customer_data_describe = customer_data.describe()
display(customer_data_describe)

CUSTOMER DATA INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

CUSTOMER DATA HEAD

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

CUSTOMER DATA DESCRIBE

        Customer ID           Age  Income (USD/Month)
count  49171.000000  49171.000000        49171.000000
mean   28398.252283     35.363121        15015.631856
std    17714.137333     12.599066         8002.208253
min        1.000000     18.000000         2000.000000
25%    12654.500000     25.000000         8289.500000
50%    27631.000000     33.000000        14656.000000
75%    43284.500000     42.000000        21035.000000
max    60000.000000     65.000000        35000.000000

High-level Observations and Insights On Customer Dataset
- Income is in USD/Month rather than a yearly value
- Income joined with transaction table can give insight into which demographic uses cabs the most
- Gender/Age in combination with other datasets
    - See gender distribution of both companies
    - See age distribution of both companies
- No null values found

#### Transaction Dataset

In [39]:
print("TRANSACTION DATA INFO")
transaction_data_info = transaction_data.info()
print("\nTRANSACTION DATA HEAD")
transaction_data_head = transaction_data.head()
display(transaction_data_head)
print("\nTRANSACTION DATA DESCRIBE")
transaction_data_describe = transaction_data.describe()
display(transaction_data_describe)

TRANSACTION DATA INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

TRANSACTION DATA HEAD

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

TRANSACTION DATA DESCRIBE

       Transaction ID    Customer ID
count    4.400980e+05  440098.000000
mean     1.022006e+07   23619.513120
std      1.270455e+05   21195.549816
min      1.000001e+07       1.000000
25%      1.011004e+07    3530.000000
50%      1.022006e+07   15168.000000
75%      1.033008e+07   43884.000000
max      1.044011e+07   60000.000000

High-level Observations and Insights On Transaction Dataset\
- Payment_Mode column can be used to find the preferred type of payment
    - Can be expanded with other datasets to find if the preference 
    has trends with age, gender, etc.
- No null values found